# Ìå®ÌÇ§ÏßÄ
- ÏÑ§ÏπòÌïòÎäî Ìå®ÌÇ§ÏßÄÎ•º Ï≠â Ï†ïÎ†¨Ìï¥ ÎÜìÎäî Î∞©Î≤ïÎèÑ ÏûàÏùå. Ï≤òÏùåÏóê Ìå®ÌÇ§ÏßÄ Îã§ Îã§Ïö¥Î∞õÍ≥† ÏãúÏûëÌïòÎèÑÎ°ù

In [3]:
# pip install emoji // emoji Ìå®ÌÇ§ÏßÄÎ•º ÏÑ§ÏπòÌïú Í≤É! Ìïú Î≤à Îçî ÏÑ§ÏπòÌïòÎ©¥ Ïïà ÎêòÎãàÍπå ÏÑ§ÏπòÌïòÍ≥† ÎÇòÏÑú Ï£ºÏÑùÏ≤òÎ¶¨ Ìïú Í≤É

In [4]:
import emoji

In [5]:
print(emoji.emojize('Phd is very easy!! :thumbs_up:'))

Phd is very easy!! üëç

In [8]:
print(emoji.emojize(':red_heart:'))

‚ù§Ô∏è

In [13]:
# pip install pydataset

In [14]:
import pydataset as pds

# dataset

In [16]:
pds.data() #pydÏïàÏóê 757Í∞úÏùò Îç∞Ïù¥ÌÑ∞Í∞Ä ÏûàÏùåÏùÑ ÌôïÏù∏ Í∞ÄÎä•

        dataset_id                                             title
0    AirPassengers       Monthly Airline Passenger Numbers 1949-1960
1          BJsales                 Sales Data with Leading Indicator
2              BOD                         Biochemical Oxygen Demand
3     Formaldehyde                     Determination of Formaldehyde
4     HairEyeColor         Hair and Eye Color of Statistics Students
..             ...                                               ...
752        VerbAgg                  Verbal Aggression item responses
753           cake                 Breakage Angle of Chocolate Cakes
754           cbpp                 Contagious bovine pleuropneumonia
755    grouseticks  Data on red grouse ticks from Elston et al. 2001
756     sleepstudy       Reaction times in a sleep deprivation study

[757 rows x 2 columns]

In [18]:
data = pds.data()

In [19]:
data.head()

      dataset_id                                        title
0  AirPassengers  Monthly Airline Passenger Numbers 1949-1960
1        BJsales            Sales Data with Leading Indicator
2            BOD                    Biochemical Oxygen Demand
3   Formaldehyde                Determination of Formaldehyde
4   HairEyeColor    Hair and Eye Color of Statistics Students

### Îç∞Ïù¥ÌÑ∞ Ï∞æÍ∏∞

In [24]:
data[data['dataset_id']=='mtcars']

   dataset_id                       title
47     mtcars  Motor Trend Car Road Tests

In [25]:
df = pds.data('mtcars')

In [27]:
df.shape

(32, 11)

In [30]:
df['am'].value_counts()

0    19
1    13
Name: am, dtype: int64

In [31]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 32 entries, Mazda RX4 to Volvo 142E
Data columns (total 11 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   mpg     32 non-null     float64
 1   cyl     32 non-null     int64
 2   disp    32 non-null     float64
 3   hp      32 non-null     int64
 4   drat    32 non-null     float64
 5   wt      32 non-null     float64
 6   qsec    32 non-null     float64
 7   vs      32 non-null     int64
 8   am      32 non-null     int64
 9   gear    32 non-null     int64
 10  carb    32 non-null     int64
dtypes: float64(5), int64(6)
memory usage: 3.0+ KB

In [33]:
df.head(1)

            mpg  cyl   disp   hp  drat    wt   qsec  vs  am  gear  carb
Mazda RX4  21.0    6  160.0  110   3.9  2.62  16.46   0   1     4     4

In [41]:
df1 = df[(df['am']== 0) & (df['gear'] == 4)]

In [42]:
len(df1)

4

In [47]:
import pandas as pd

In [48]:
Hr = pd.read_csv('HR-Employee-Attrition.csv')

In [50]:
Hr.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1470 entries, 0 to 1469
Data columns (total 35 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Age                       1470 non-null   int64
 1   Attrition                 1470 non-null   object
 2   BusinessTravel            1470 non-null   object
 3   DailyRate                 1470 non-null   int64
 4   Department                1470 non-null   object
 5   DistanceFromHome          1470 non-null   int64
 6   Education                 1470 non-null   int64
 7   EducationField            1470 non-null   object
 8   EmployeeCount             1470 non-null   int64
 9   EmployeeNumber            1470 non-null   int64
 10  EnvironmentSatisfaction   1470 non-null   int64
 11  Gender                    1470 non-null   object
 12  HourlyRate                1470 non-null   int64
 13  JobInvolvement            1470 non-null   int64
 14  JobLevel                  1470 non-null   int64
 15  JobRole                   1470 non-null   object
 16  JobSatisfaction           1470 non-null   int64
 17  MaritalStatus             1470 non-null   object
 18  MonthlyIncome             1470 non-null   int64
 19  MonthlyRate               1470 non-null   int64
 20  NumCompaniesWorked        1470 non-null   int64
 21  Over18                    1470 non-null   object
 22  OverTime                  1470 non-null   object
 23  PercentSalaryHike         1470 non-null   int64
 24  PerformanceRating         1470 non-null   int64
 25  RelationshipSatisfaction  1470 non-null   int64
 26  StandardHours             1470 non-null   int64
 27  StockOptionLevel          1470 non-null   int64
 28  TotalWorkingYears         1470 non-null   int64
 29  TrainingTimesLastYear     1470 non-null   int64
 30  WorkLifeBalance           1470 non-null   int64
 31  YearsAtCompany            1470 non-null   int64
 32  YearsInCurrentRole        1470 non-null   int64
 33  YearsSinceLastPromotion   1470 non-null   int64
 34  YearsWithCurrManager      1470 non-null   int64
dtypes: int64(26), object(9)
memory usage: 402.1+ KB

In [52]:
Hr.head(1)

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,EmployeeCount,EmployeeNumber,...,RelationshipSatisfaction,StandardHours,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
0,41,Yes,Travel_Rarely,1102,Sales,1,2,Life Sciences,1,1,...,1,80,0,8,0,1,6,4,0,5

#### 1Î≤à Î¨∏Ï†ú
(ÏòÜÏûêÎ¶¨ ÏÇ¨ÎûåÍ≥º Î¨∏Ï†ú ÎÇ¥Í∏∞)
- GenderÍ∞Ä FemaleÏù¥Í≥† MonthlyRateÍ∞Ä 10000Ïù¥ÏÉÅÏù∏ ÏÇ¨ÎûåÏùò Ïàò

In [58]:
len(Hr[(Hr['Gender']=='Female') & (Hr['MonthlyRate'] >= 10000)])

403

#### 2Î≤à Î¨∏Ï†ú
- EducationFieldÍ∞Ä MedicalÏù¥Í±∞ÎÇò JobSatisfactionÍ∞Ä 3 Ïù¥ÏÉÅÏù∏ ÏÇ¨ÎûåÏùò Ïàò

In [68]:
len(Hr[(Hr['EducationField'] == 'Medical') | (Hr['JobSatisfaction'] >= 3)])

1083

In [61]:
Hr['EducationField'].value_counts()

Life Sciences       606
Medical             464
Marketing           159
Technical Degree    132
Other                82
Human Resources      27
Name: EducationField, dtype: int64

In [63]:
Hr['JobSatisfaction'].value_counts()

4    459
3    442
1    289
2    280
Name: JobSatisfaction, dtype: int64

In [ ]:
import pandas as pd

In [70]:
df = pd.DataFrame({'name' : ['ÍπÄÏßÄÌõà','Ïù¥Ïú†ÏßÑ','Î∞ïÎèôÌòÑ','ÍπÄÎØºÏßÄ'],
                   'english' : [90,80,60,70,],
                   'math' : [50,60,100,20]})
df

  name  english  math
0  ÍπÄÏßÄÌõà       90    50
1  Ïù¥Ïú†ÏßÑ       80    60
2  Î∞ïÎèôÌòÑ       60   100
3  ÍπÄÎØºÏßÄ       70    20

In [71]:
df['english'].sum()

300

In [72]:
df['english'].mean()

75.0

### rename Îç∞Ïù¥ÌÑ∞ Ïó¥ Ïù¥Î¶Ñ Î∞îÍæ∏Í∏∞

In [73]:
df=df.rename({'name' : 'Ïù¥Î¶Ñ'}, axis = 1)

In [74]:
df

    Ïù¥Î¶Ñ  english  math
0  ÍπÄÏßÄÌõà       90    50
1  Ïù¥Ïú†ÏßÑ       80    60
2  Î∞ïÎèôÌòÑ       60   100
3  ÍπÄÎØºÏßÄ       70    20

In [75]:
df2 =df

In [76]:
df2

    Ïù¥Î¶Ñ  english  math
0  ÍπÄÏßÄÌõà       90    50
1  Ïù¥Ïú†ÏßÑ       80    60
2  Î∞ïÎèôÌòÑ       60   100
3  ÍπÄÎØºÏßÄ       70    20

In [78]:
df = df.rename({'Ïù¥Î¶Ñ' : 'name'}, axis=1)

In [79]:
df

  name  english  math
0  ÍπÄÏßÄÌõà       90    50
1  Ïù¥Ïú†ÏßÑ       80    60
2  Î∞ïÎèôÌòÑ       60   100
3  ÍπÄÎØºÏßÄ       70    20

In [80]:
df2

    Ïù¥Î¶Ñ  english  math
0  ÍπÄÏßÄÌõà       90    50
1  Ïù¥Ïú†ÏßÑ       80    60
2  Î∞ïÎèôÌòÑ       60   100
3  ÍπÄÎØºÏßÄ       70    20

In [82]:
df['name'] = ['Ïù¥Ìò∏ÏßÑ', 'Ïù¥Ìò∏ÏßÑ', 'Ïù¥Ìò∏ÏßÑ', 'Ïù¥Ìò∏ÏßÑ']

In [83]:
df

  name  english  math
0  Ïù¥Ìò∏ÏßÑ       90    50
1  Ïù¥Ìò∏ÏßÑ       80    60
2  Ïù¥Ìò∏ÏßÑ       60   100
3  Ïù¥Ìò∏ÏßÑ       70    20

In [84]:
df3 =df

In [86]:
df['name'] = 'ÌôçÍ∏∏Îèô'

In [87]:
df

  name  english  math
0  ÌôçÍ∏∏Îèô       90    50
1  ÌôçÍ∏∏Îèô       80    60
2  ÌôçÍ∏∏Îèô       60   100
3  ÌôçÍ∏∏Îèô       70    20

In [89]:
df['name']='ÏòàÏßÑ'

In [90]:
df3

  name  english  math
0  ÌôçÍ∏∏Îèô       90    50
1  ÌôçÍ∏∏Îèô       80    60
2  ÌôçÍ∏∏Îèô       60   100
3  ÌôçÍ∏∏Îèô       70    20

In [91]:
df

  name  english  math
0   ÏòàÏßÑ       90    50
1   ÏòàÏßÑ       80    60
2   ÏòàÏßÑ       60   100
3   ÏòàÏßÑ       70    20

## ÏñïÏùÄ Î≥µÏÇ¨ & ÍπäÏùÄ Î≥µÏÇ¨
df              Î≥ÄÏàòÎ™Ö  
df2 = df        Í∑∏ÎÉ• Î≥ÄÏàòÎ™Ö Î≥µÏÇ¨(Í∏∞Î≥∏)  / ÏññÏùÄ Î≥µÏÇ¨(shallow copy)  (ÏõêÎ≥∏ÏùÄ ÌïòÎÇòÍ≥† Î≥ÄÏàòÎ™ÖÎßå Îëê Í∞úÍ∞Ä Îê®)  
df3 = df.copy()                       / ÍπäÏùÄ Î≥µÏÇ¨(deep copy) (ÏõêÎ≥∏ÏùÑ Î≥µÏÇ¨Ìï¥ÏÑú Í∞ÅÍ∞Å Î≥ÄÏàòÎßàÎã§ ÏõêÎ≥∏ÏùÑ Í∞ÄÏßê)

In [92]:
print(id(df))
print(id(df2))
print(id(df3))

2335246637904
2335188448064
2335250041536

# ÌååÏÉùÎ≥ÄÏàò

In [93]:
df = pd.DataFrame({'var1':[3,4,8],
                   'var2':[2,6,1]})

In [94]:
df

   var1  var2
0     3     2
1     4     6
2     8     1

In [95]:
df['var_sum'] = df['var1'] + df['var2']

In [96]:
df

   var1  var2  var_sum
0     3     2        5
1     4     6       10
2     8     1        9

In [97]:
df['var_mean'] = (df['var1'] + df['var2'])/2

In [98]:
df

   var1  var2  var_sum  var_mean
0     3     2        5       2.5
1     4     6       10       5.0
2     8     1        9       4.5

In [176]:
import pydataset as ads

In [177]:
mpg = pds.data('mpg', show_doc=True) # show_doc=TrueÎäî mpg Îç∞Ïù¥ÌÑ∞Ïóê ÎåÄÌïú ÏÑ§Î™Ö

mpg

PyDataset Documentation (adopted from R Documentation. The displayed examples are in R)

## Fuel economy data from 1999 and 2008 for 38 popular models of car

### Description

This dataset contains a subset of the fuel economy data that the EPA makes
available on http://fueleconomy.gov. It contains only models which had a new
release every year between 1999 and 2008 - this was used as a proxy for the
popularity of the car.

### Usage

    data(mpg)

### Format

A data frame with 234 rows and 11 variables

### Details

  * manufacturer.

  * model.

  * displ. engine displacement, in litres

  * year.

  * cyl. number of cylinders

  * trans. type of transmission

  * drv. f = front-wheel drive, r = rear wheel drive, 4 = 4wd

  * cty. city miles per gallon

  * hwy. highway miles per gallon

  * fl.

  * class.

In [178]:
mpg = pds.data('mpg')

In [108]:
mpg

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact
...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize

In [110]:
mpg['total'] = (mpg['cty'] + mpg['hwy']) / 2 # ÌÜµÌï© Ïó∞ÎπÑ Î≥ÄÏàò

In [113]:
mpg['total'].mean()

20.14957264957265

In [120]:
len(mpg[mpg['total'] >= 20])

128

In [122]:
# 20  > pass
# 20 <= fail
mpg

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class,total
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,23.5
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,25.0
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,25.5
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,25.5
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,21.0
...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,23.5
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,25.0
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,21.0
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,22.0
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,21.5

## .apply(Ìï®Ïàò)
- Ïñ¥Îñ§ Ìï®ÏàòÎ•º ÏãúÎ¶¨Ï¶à Îç∞Ïù¥ÌÑ∞Ïóê Î™®Îëê Îã§ Ï†ÅÏö©ÌïòÍ≥† Ïã∂ÏùÑ Îïå ÏîÄ
- Ïì∞Í≥† Ïã∂ÏúºÎ©¥ Î®ºÏ†Ä Ìï®ÏàòÎ•º ÎßåÎì§Ïñ¥Ïïº Ìï®.

In [124]:
def isPass(t) :
    if t > 20 :
        return 'Pass'
    else :
        return 'Fail'

In [125]:
mpg['total'].apply(isPass)

1      Pass
2      Pass
3      Pass
4      Pass
5      Pass
       ...
230    Pass
231    Pass
232    Pass
233    Pass
234    Pass
Name: total, Length: 234, dtype: object

In [126]:
mpg['test'] = mpg['total'].apply(isPass)

In [127]:
mpg['test'].value_counts()

Pass    123
Fail    111
Name: test, dtype: int64

In [134]:
# mpg['total'] >= 30 'A'
# mpg['total'] >= 20 'B'
# else 'C'
# mpg['grade']

In [130]:
def Grade(g) :
    if g >= 30 :
        return 'A'
    elif g >= 20 :
        return 'B'
    else :
        return 'C'

In [132]:
mpg['grade'] = mpg['total'].apply(Grade)

In [148]:
mpg['grade'].value_counts().sort_index() # Í∞íÏúºÎ°ú ÌïòÍ≥† Ïã∂ÏúºÎ©¥ .sort_value

A     10
B    118
C    106
Name: grade, dtype: int64

In [149]:
len(mpg[mpg['total'] >= 20])

128

In [150]:
len(mpg[mpg['total'] >= 30])

10

# numpy

In [152]:
import numpy as np

In [154]:
mpg['test2'] = np.where(mpg['total'] > 20, 'Pass', 'Fail')

In [155]:
mpg['test2'].value_counts()

Pass    123
Fail    111
Name: test2, dtype: int64

In [158]:
np.where(mpg['total'] > 30, 'A',
np.where(mpg['total'] > 20, 'B', 'Fail'))

array(['B', 'B', 'B', 'B', 'B', 'B', 'B', 'B', 'B', 'B', 'B', 'Fail', 'B',
       'B', 'Fail', 'Fail', 'B', 'Fail', 'Fail', 'Fail', 'Fail', 'Fail',
       'Fail', 'B', 'Fail', 'B', 'Fail', 'Fail', 'Fail', 'Fail', 'Fail',
       'Fail', 'B', 'B', 'B', 'B', 'B', 'B', 'B', 'Fail', 'Fail', 'B',
       'B', 'Fail', 'Fail', 'Fail', 'Fail', 'Fail', 'Fail', 'Fail',
       'Fail', 'Fail', 'Fail', 'Fail', 'Fail', 'Fail', 'Fail', 'Fail',
       'Fail', 'Fail', 'Fail', 'Fail', 'Fail', 'Fail', 'Fail', 'Fail',
       'Fail', 'Fail', 'Fail', 'Fail', 'Fail', 'Fail', 'Fail', 'Fail',
       'Fail', 'Fail', 'Fail', 'Fail', 'Fail', 'Fail', 'Fail', 'Fail',
       'Fail', 'Fail', 'Fail', 'Fail', 'Fail', 'Fail', 'Fail', 'Fail',
       'B', 'B', 'B', 'Fail', 'Fail', 'Fail', 'Fail', 'Fail', 'Fail', 'A',
       'B', 'B', 'B', 'B', 'B', 'A', 'B', 'B', 'B', 'B', 'B', 'B', 'B',
       'B', 'B', 'B', 'B', 'B', 'B', 'B', 'Fail', 'B', 'Fail', 'Fail',
       'Fail', 'Fail', 'Fail', 'Fail', 'Fail', 'Fail', 'Fail', 'Fail',
       'Fail', 'Fail', 'Fail', 'Fail', 'Fail', 'Fail', 'Fail', 'Fail',
       'Fail', 'B', 'B', 'B', 'B', 'B', 'B', 'B', 'B', 'B', 'Fail',
       'Fail', 'Fail', 'Fail', 'B', 'B', 'B', 'B', 'B', 'B', 'B', 'B',
       'B', 'B', 'B', 'B', 'B', 'B', 'B', 'B', 'B', 'B', 'B', 'Fail',
       'Fail', 'Fail', 'Fail', 'Fail', 'Fail', 'B', 'B', 'B', 'B', 'B',
       'B', 'B', 'B', 'B', 'B', 'B', 'B', 'B', 'B', 'B', 'B', 'A', 'A',
       'A', 'Fail', 'Fail', 'Fail', 'Fail', 'Fail', 'Fail', 'Fail',
       'Fail', 'Fail', 'B', 'B', 'B', 'B', 'B', 'A', 'B', 'B', 'B', 'B',
       'B', 'B', 'Fail', 'B', 'A', 'A', 'B', 'B', 'B', 'B', 'B', 'B', 'B',
       'B', 'B', 'B', 'B'], dtype='<U4')

In [174]:
mpg['grade2'] = np.where(mpg['total'] >= 30, 'A',        # mpg['total'] >= 30, 'A',ÏùÄ Ï°∞Í±¥,
                np.where(mpg['total'] >= 20, 'B', 'C'))  # mpg['total'] >= 20, 'B',ÎèÑ Ï°∞Í±¥Î¨∏, Í∑∏Î¶¨Í≥† Î∞îÎ°ú Îí§Ïóê 'C'Í∞Ä Ï°∞Í±¥Ïù¥ Ï∂©Ï°±ÎêòÏßÄ ÏïäÎäî ÎÇòÎ®∏ÏßÄÎ•º ÎßêÌï®.
                                                         # 'C'Í∞ôÏùÄ Ï°∞Í±¥Ïù¥ Ï∂©Ï°±ÎêòÏßÄ ÏïäÎäî Í≤ΩÏö∞Ïù∏ ÎÇòÎ®∏ÏßÄ Í∞íÏùÑ Ïïà ÎÑ£ÏúºÎ©¥ ÏóêÎü¨Í∞Ä Îú∏!

In [172]:
mpg['grade2'].value_counts().sort_index()

A     10
B    118
C    106
Name: grade2, dtype: int64

In [183]:
mpg['class'].unique()

array(['compact', 'midsize', 'suv', '2seater', 'minivan', 'pickup',
       'subcompact'], dtype=object)

In [180]:
# class -> compact, subcompact, 2esater Ïù¥Î©¥ small ÏïÑÎãàÎ©¥ large

In [ ]:
mpg['size']

In [194]:
def Size(s) :
    if s == 'compact' :
        return 'small'
    elif s == 'subcompact' :
        return 'small'
    elif s == '2esater' :
        return 'small'
    else :
        return 'large'

In [ ]:
def Size(s) :
    if s  in ['compact', subcompact' :
        return 'small'
    elif s == '' :
        return 'small'
    elif s == '2esater' :
        return 'small'
    else :
        return 'large'

In [200]:
mpg['class'][:].apply(Size)

1      small
2      small
3      small
4      small
5      small
       ...
230    large
231    large
232    large
233    large
234    large
Name: class, Length: 234, dtype: object

In [198]:
mpg['class'].value_counts()

suv           62
compact       47
midsize       41
subcompact    35
pickup        33
minivan       11
2seater        5
Name: class, dtype: int64